
exports.years = ['أولى', 'تانية', 'تالتة', 'رابعة'];
exports.prepYear = ['النصف الأول', 'النصف الثاني'];

exports.mapping = {
  الكترونيات: [1, 2, 3, 4],

  'كهرباء قوى': [5, 6, 7, 8],

  تعدين: [12],

  بترول: [52, 9, 10, 11],

  فلزات: [53, 25, 26, 27],

  مناجم: [51, 36, 37, 38],

  طبية: [13, 14, 15, 16],

  طيران: [17, 18, 19, 20],

  عمارة: [21, 22, 23, 24],

  كيمياء: [28, 29, 30, 31],

  مدنى: [32, 33, 34, 35],

  ميكانيكا: [41, 42],

  'ميكانيا قوى': [39, 40],

  'ميكانيكا انتاج': [43, 44],

  'هندسة الحاسبات': [45, 46, 47, 48],

  اعدادي: [49, 50],
};